###############################################################################
# Created by write_sdc
# Wed Oct  1 15:25:42 2025
###############################################################################
current_design sram_multiplier_system
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_clock_uncertainty 0.1000 core_clock
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[10]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[11]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[12]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[13]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[14]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[15]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[16]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[17]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[18]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[19]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[20]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[21]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[22]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[23]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[24]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[25]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[26]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[27]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[28]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[29]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[30]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[31]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[8]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_in[9]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {init_enable}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {pe_ce}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[15]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[16]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[17]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[18]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[19]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[20]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[21]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[22]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[23]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[24]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[25]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[26]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[27]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[28]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[29]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[30]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[31]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[32]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[33]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[34]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[35]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[36]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[37]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[38]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[39]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[40]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[41]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[42]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[43]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[44]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[45]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[46]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[47]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[48]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[49]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[50]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[51]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[52]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[53]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[54]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[55]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[56]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[57]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[58]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[59]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[60]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[61]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[62]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[63]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {init_done}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {valid_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.5000 [get_ports {init_done}]
set_load -pin_load 0.5000 [get_ports {valid_out}]
set_load -pin_load 0.5000 [get_ports {data_out[63]}]
set_load -pin_load 0.5000 [get_ports {data_out[62]}]
set_load -pin_load 0.5000 [get_ports {data_out[61]}]
set_load -pin_load 0.5000 [get_ports {data_out[60]}]
set_load -pin_load 0.5000 [get_ports {data_out[59]}]
set_load -pin_load 0.5000 [get_ports {data_out[58]}]
set_load -pin_load 0.5000 [get_ports {data_out[57]}]
set_load -pin_load 0.5000 [get_ports {data_out[56]}]
set_load -pin_load 0.5000 [get_ports {data_out[55]}]
set_load -pin_load 0.5000 [get_ports {data_out[54]}]
set_load -pin_load 0.5000 [get_ports {data_out[53]}]
set_load -pin_load 0.5000 [get_ports {data_out[52]}]
set_load -pin_load 0.5000 [get_ports {data_out[51]}]
set_load -pin_load 0.5000 [get_ports {data_out[50]}]
set_load -pin_load 0.5000 [get_ports {data_out[49]}]
set_load -pin_load 0.5000 [get_ports {data_out[48]}]
set_load -pin_load 0.5000 [get_ports {data_out[47]}]
set_load -pin_load 0.5000 [get_ports {data_out[46]}]
set_load -pin_load 0.5000 [get_ports {data_out[45]}]
set_load -pin_load 0.5000 [get_ports {data_out[44]}]
set_load -pin_load 0.5000 [get_ports {data_out[43]}]
set_load -pin_load 0.5000 [get_ports {data_out[42]}]
set_load -pin_load 0.5000 [get_ports {data_out[41]}]
set_load -pin_load 0.5000 [get_ports {data_out[40]}]
set_load -pin_load 0.5000 [get_ports {data_out[39]}]
set_load -pin_load 0.5000 [get_ports {data_out[38]}]
set_load -pin_load 0.5000 [get_ports {data_out[37]}]
set_load -pin_load 0.5000 [get_ports {data_out[36]}]
set_load -pin_load 0.5000 [get_ports {data_out[35]}]
set_load -pin_load 0.5000 [get_ports {data_out[34]}]
set_load -pin_load 0.5000 [get_ports {data_out[33]}]
set_load -pin_load 0.5000 [get_ports {data_out[32]}]
set_load -pin_load 0.5000 [get_ports {data_out[31]}]
set_load -pin_load 0.5000 [get_ports {data_out[30]}]
set_load -pin_load 0.5000 [get_ports {data_out[29]}]
set_load -pin_load 0.5000 [get_ports {data_out[28]}]
set_load -pin_load 0.5000 [get_ports {data_out[27]}]
set_load -pin_load 0.5000 [get_ports {data_out[26]}]
set_load -pin_load 0.5000 [get_ports {data_out[25]}]
set_load -pin_load 0.5000 [get_ports {data_out[24]}]
set_load -pin_load 0.5000 [get_ports {data_out[23]}]
set_load -pin_load 0.5000 [get_ports {data_out[22]}]
set_load -pin_load 0.5000 [get_ports {data_out[21]}]
set_load -pin_load 0.5000 [get_ports {data_out[20]}]
set_load -pin_load 0.5000 [get_ports {data_out[19]}]
set_load -pin_load 0.5000 [get_ports {data_out[18]}]
set_load -pin_load 0.5000 [get_ports {data_out[17]}]
set_load -pin_load 0.5000 [get_ports {data_out[16]}]
set_load -pin_load 0.5000 [get_ports {data_out[15]}]
set_load -pin_load 0.5000 [get_ports {data_out[14]}]
set_load -pin_load 0.5000 [get_ports {data_out[13]}]
set_load -pin_load 0.5000 [get_ports {data_out[12]}]
set_load -pin_load 0.5000 [get_ports {data_out[11]}]
set_load -pin_load 0.5000 [get_ports {data_out[10]}]
set_load -pin_load 0.5000 [get_ports {data_out[9]}]
set_load -pin_load 0.5000 [get_ports {data_out[8]}]
set_load -pin_load 0.5000 [get_ports {data_out[7]}]
set_load -pin_load 0.5000 [get_ports {data_out[6]}]
set_load -pin_load 0.5000 [get_ports {data_out[5]}]
set_load -pin_load 0.5000 [get_ports {data_out[4]}]
set_load -pin_load 0.5000 [get_ports {data_out[3]}]
set_load -pin_load 0.5000 [get_ports {data_out[2]}]
set_load -pin_load 0.5000 [get_ports {data_out[1]}]
set_load -pin_load 0.5000 [get_ports {data_out[0]}]
set_drive -rise 1.0000 [get_ports {data_in[31]}]
set_drive -fall 1.0000 [get_ports {data_in[31]}]
set_drive -rise 1.0000 [get_ports {data_in[30]}]
set_drive -fall 1.0000 [get_ports {data_in[30]}]
set_drive -rise 1.0000 [get_ports {data_in[29]}]
set_drive -fall 1.0000 [get_ports {data_in[29]}]
set_drive -rise 1.0000 [get_ports {data_in[28]}]
set_drive -fall 1.0000 [get_ports {data_in[28]}]
set_drive -rise 1.0000 [get_ports {data_in[27]}]
set_drive -fall 1.0000 [get_ports {data_in[27]}]
set_drive -rise 1.0000 [get_ports {data_in[26]}]
set_drive -fall 1.0000 [get_ports {data_in[26]}]
set_drive -rise 1.0000 [get_ports {data_in[25]}]
set_drive -fall 1.0000 [get_ports {data_in[25]}]
set_drive -rise 1.0000 [get_ports {data_in[24]}]
set_drive -fall 1.0000 [get_ports {data_in[24]}]
set_drive -rise 1.0000 [get_ports {data_in[23]}]
set_drive -fall 1.0000 [get_ports {data_in[23]}]
set_drive -rise 1.0000 [get_ports {data_in[22]}]
set_drive -fall 1.0000 [get_ports {data_in[22]}]
set_drive -rise 1.0000 [get_ports {data_in[21]}]
set_drive -fall 1.0000 [get_ports {data_in[21]}]
set_drive -rise 1.0000 [get_ports {data_in[20]}]
set_drive -fall 1.0000 [get_ports {data_in[20]}]
set_drive -rise 1.0000 [get_ports {data_in[19]}]
set_drive -fall 1.0000 [get_ports {data_in[19]}]
set_drive -rise 1.0000 [get_ports {data_in[18]}]
set_drive -fall 1.0000 [get_ports {data_in[18]}]
set_drive -rise 1.0000 [get_ports {data_in[17]}]
set_drive -fall 1.0000 [get_ports {data_in[17]}]
set_drive -rise 1.0000 [get_ports {data_in[16]}]
set_drive -fall 1.0000 [get_ports {data_in[16]}]
set_drive -rise 1.0000 [get_ports {data_in[15]}]
set_drive -fall 1.0000 [get_ports {data_in[15]}]
set_drive -rise 1.0000 [get_ports {data_in[14]}]
set_drive -fall 1.0000 [get_ports {data_in[14]}]
set_drive -rise 1.0000 [get_ports {data_in[13]}]
set_drive -fall 1.0000 [get_ports {data_in[13]}]
set_drive -rise 1.0000 [get_ports {data_in[12]}]
set_drive -fall 1.0000 [get_ports {data_in[12]}]
set_drive -rise 1.0000 [get_ports {data_in[11]}]
set_drive -fall 1.0000 [get_ports {data_in[11]}]
set_drive -rise 1.0000 [get_ports {data_in[10]}]
set_drive -fall 1.0000 [get_ports {data_in[10]}]
set_drive -rise 1.0000 [get_ports {data_in[9]}]
set_drive -fall 1.0000 [get_ports {data_in[9]}]
set_drive -rise 1.0000 [get_ports {data_in[8]}]
set_drive -fall 1.0000 [get_ports {data_in[8]}]
set_drive -rise 1.0000 [get_ports {data_in[7]}]
set_drive -fall 1.0000 [get_ports {data_in[7]}]
set_drive -rise 1.0000 [get_ports {data_in[6]}]
set_drive -fall 1.0000 [get_ports {data_in[6]}]
set_drive -rise 1.0000 [get_ports {data_in[5]}]
set_drive -fall 1.0000 [get_ports {data_in[5]}]
set_drive -rise 1.0000 [get_ports {data_in[4]}]
set_drive -fall 1.0000 [get_ports {data_in[4]}]
set_drive -rise 1.0000 [get_ports {data_in[3]}]
set_drive -fall 1.0000 [get_ports {data_in[3]}]
set_drive -rise 1.0000 [get_ports {data_in[2]}]
set_drive -fall 1.0000 [get_ports {data_in[2]}]
set_drive -rise 1.0000 [get_ports {data_in[1]}]
set_drive -fall 1.0000 [get_ports {data_in[1]}]
set_drive -rise 1.0000 [get_ports {data_in[0]}]
set_drive -fall 1.0000 [get_ports {data_in[0]}]
###############################################################################
# Design Rules
###############################################################################
